{
  "transform_params" : {
    "image" : {
      "bias_a" : 0,
      "bias_g" : 0,
      "bias_r" : 0,
      "bias_b" : 0,
      "center_mean" : 0,
      "is_network_bgr" : 0,
      "scale" : 1
    }
  },
  "properties" : {

  },
  "analyses" : {

  },
  "format_version" : 200,
  "storage" : "model.espresso.weights",
  "layers" : [
    {
      "name" : "transformer_pad0",
      "weights" : {

      },
      "pad_pad_mode" : 0,
      "pad_t" : 4,
      "pad_r" : 4,
      "pad_b" : 4,
      "type" : "general_padding",
      "pad_fill_mode" : 2,
      "bottom" : "image",
      "pad_l" : 4,
      "debug_info" : "transformer_pad0",
      "pad_value" : 0,
      "top" : "transformer_pad0"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "transformer_encode_1_conv",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "transformer_conv0_fwd",
      "blob_weights" : 3,
      "K" : 3,
      "blob_biases" : 1,
      "name" : "transformer_encode_1_conv",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 32,
      "bottom" : "transformer_pad0",
      "weights" : {

      },
      "Nx" : 9,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 9,
      "n_parallel" : 1
    },
    {
      "name" : "transformer_instancenorm0__fwd_normalize",
      "training_momentum" : 0.89999997615814209,
      "training_eps" : 9.9999997473787516e-06,
      "C" : 32,
      "training" : 1,
      "training_instancenorm" : 1,
      "type" : "batchnorm",
      "blob_batchnorm_params" : 5,
      "bottom" : "transformer_conv0_fwd",
      "debug_info" : "transformer_instancenorm0__fwd_normalize",
      "weights" : {

      },
      "top" : "transformer_instancenorm0__fwd"
    },
    {
      "bottom" : "transformer_instancenorm0__fwd",
      "weights" : {

      },
      "mode" : 0,
      "debug_info" : "transformer_activation0",
      "top" : "transformer_activation0",
      "type" : "activation",
      "name" : "transformer_activation0"
    },
    {
      "name" : "transformer_pad1",
      "weights" : {

      },
      "pad_pad_mode" : 0,
      "pad_t" : 1,
      "pad_r" : 1,
      "pad_b" : 1,
      "type" : "general_padding",
      "pad_fill_mode" : 2,
      "bottom" : "transformer_activation0",
      "pad_l" : 1,
      "debug_info" : "transformer_pad1",
      "pad_value" : 0,
      "top" : "transformer_pad1"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "transformer_encode_2_conv",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "transformer_conv1_fwd",
      "blob_weights" : 9,
      "K" : 32,
      "blob_biases" : 7,
      "stride_x" : 2,
      "name" : "transformer_encode_2_conv",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "stride_y" : 2,
      "has_biases" : 1,
      "C" : 64,
      "bottom" : "transformer_pad1",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "name" : "transformer_instancenorm1__fwd_normalize",
      "training_momentum" : 0.89999997615814209,
      "training_eps" : 9.9999997473787516e-06,
      "C" : 64,
      "training" : 1,
      "training_instancenorm" : 1,
      "type" : "batchnorm",
      "blob_batchnorm_params" : 11,
      "bottom" : "transformer_conv1_fwd",
      "debug_info" : "transformer_instancenorm1__fwd_normalize",
      "weights" : {

      },
      "top" : "transformer_instancenorm1__fwd"
    },
    {
      "bottom" : "transformer_instancenorm1__fwd",
      "weights" : {

      },
      "mode" : 0,
      "debug_info" : "transformer_activation1",
      "top" : "transformer_activation1",
      "type" : "activation",
      "name" : "transformer_activation1"
    },
    {
      "name" : "transformer_pad2",
      "weights" : {

      },
      "pad_pad_mode" : 0,
      "pad_t" : 1,
      "pad_r" : 1,
      "pad_b" : 1,
      "type" : "general_padding",
      "pad_fill_mode" : 2,
      "bottom" : "transformer_activation1",
      "pad_l" : 1,
      "debug_info" : "transformer_pad2",
      "pad_value" : 0,
      "top" : "transformer_pad2"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "transformer_encode_3_conv",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "transformer_conv2_fwd",
      "blob_weights" : 15,
      "K" : 64,
      "blob_biases" : 13,
      "stride_x" : 2,
      "name" : "transformer_encode_3_conv",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "stride_y" : 2,
      "has_biases" : 1,
      "C" : 128,
      "bottom" : "transformer_pad2",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "name" : "transformer_instancenorm2__fwd_normalize",
      "training_momentum" : 0.89999997615814209,
      "training_eps" : 9.9999997473787516e-06,
      "C" : 128,
      "training" : 1,
      "training_instancenorm" : 1,
      "type" : "batchnorm",
      "blob_batchnorm_params" : 17,
      "bottom" : "transformer_conv2_fwd",
      "debug_info" : "transformer_instancenorm2__fwd_normalize",
      "weights" : {

      },
      "top" : "transformer_instancenorm2__fwd"
    },
    {
      "bottom" : "transformer_instancenorm2__fwd",
      "weights" : {

      },
      "mode" : 0,
      "debug_info" : "transformer_activation2",
      "top" : "transformer_activation2",
      "type" : "activation",
      "name" : "transformer_activation2"
    },
    {
      "name" : "transformer_residualblock0_pad0",
      "weights" : {

      },
      "pad_pad_mode" : 0,
      "pad_t" : 1,
      "pad_r" : 1,
      "pad_b" : 1,
      "type" : "general_padding",
      "pad_fill_mode" : 2,
      "bottom" : "transformer_activation2",
      "pad_l" : 1,
      "debug_info" : "transformer_residualblock0_pad0",
      "pad_value" : 0,
      "top" : "transformer_residualblock0_pad0"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "transformer_residual_1_conv_1",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "transformer_residualblock0_conv0_fwd",
      "blob_weights" : 21,
      "K" : 128,
      "blob_biases" : 19,
      "name" : "transformer_residual_1_conv_1",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 128,
      "bottom" : "transformer_residualblock0_pad0",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "name" : "transformer_residualblock0_instancenorm0__fwd_normalize",
      "training_momentum" : 0.89999997615814209,
      "training_eps" : 9.9999997473787516e-06,
      "C" : 128,
      "training" : 1,
      "training_instancenorm" : 1,
      "type" : "batchnorm",
      "blob_batchnorm_params" : 23,
      "bottom" : "transformer_residualblock0_conv0_fwd",
      "debug_info" : "transformer_residualblock0_instancenorm0__fwd_normalize",
      "weights" : {

      },
      "top" : "transformer_residualblock0_instancenorm0__fwd"
    },
    {
      "bottom" : "transformer_residualblock0_instancenorm0__fwd",
      "weights" : {

      },
      "mode" : 0,
      "debug_info" : "transformer_residualblock0_activation0",
      "top" : "transformer_residualblock0_activation0",
      "type" : "activation",
      "name" : "transformer_residualblock0_activation0"
    },
    {
      "name" : "transformer_residualblock0_pad1",
      "weights" : {

      },
      "pad_pad_mode" : 0,
      "pad_t" : 1,
      "pad_r" : 1,
      "pad_b" : 1,
      "type" : "general_padding",
      "pad_fill_mode" : 2,
      "bottom" : "transformer_residualblock0_activation0",
      "pad_l" : 1,
      "debug_info" : "transformer_residualblock0_pad1",
      "pad_value" : 0,
      "top" : "transformer_residualblock0_pad1"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "transformer_residual_1_conv_2",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "transformer_residualblock0_conv1_fwd",
      "blob_weights" : 27,
      "K" : 128,
      "blob_biases" : 25,
      "name" : "transformer_residual_1_conv_2",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 128,
      "bottom" : "transformer_residualblock0_pad1",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "name" : "transformer_residualblock0_instancenorm1__fwd_normalize",
      "training_momentum" : 0.89999997615814209,
      "training_eps" : 9.9999997473787516e-06,
      "C" : 128,
      "training" : 1,
      "training_instancenorm" : 1,
      "type" : "batchnorm",
      "blob_batchnorm_params" : 29,
      "bottom" : "transformer_residualblock0_conv1_fwd",
      "debug_info" : "transformer_residualblock0_instancenorm1__fwd_normalize",
      "weights" : {

      },
      "top" : "transformer_residualblock0_instancenorm1__fwd"
    },
    {
      "bottom" : "transformer_residualblock0_instancenorm1__fwd,transformer_activation2",
      "alpha" : 1,
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "transformer_residualblock0__plus0",
      "top" : "transformer_residualblock0__plus0",
      "type" : "elementwise",
      "name" : "transformer_residualblock0__plus0",
      "beta" : 0
    },
    {
      "name" : "transformer_residualblock1_pad0",
      "weights" : {

      },
      "pad_pad_mode" : 0,
      "pad_t" : 1,
      "pad_r" : 1,
      "pad_b" : 1,
      "type" : "general_padding",
      "pad_fill_mode" : 2,
      "bottom" : "transformer_residualblock0__plus0",
      "pad_l" : 1,
      "debug_info" : "transformer_residualblock1_pad0",
      "pad_value" : 0,
      "top" : "transformer_residualblock1_pad0"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "transformer_residual_2_conv_1",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "transformer_residualblock1_conv0_fwd",
      "blob_weights" : 33,
      "K" : 128,
      "blob_biases" : 31,
      "name" : "transformer_residual_2_conv_1",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 128,
      "bottom" : "transformer_residualblock1_pad0",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "name" : "transformer_residualblock1_instancenorm0__fwd_normalize",
      "training_momentum" : 0.89999997615814209,
      "training_eps" : 9.9999997473787516e-06,
      "C" : 128,
      "training" : 1,
      "training_instancenorm" : 1,
      "type" : "batchnorm",
      "blob_batchnorm_params" : 35,
      "bottom" : "transformer_residualblock1_conv0_fwd",
      "debug_info" : "transformer_residualblock1_instancenorm0__fwd_normalize",
      "weights" : {

      },
      "top" : "transformer_residualblock1_instancenorm0__fwd"
    },
    {
      "bottom" : "transformer_residualblock1_instancenorm0__fwd",
      "weights" : {

      },
      "mode" : 0,
      "debug_info" : "transformer_residualblock1_activation0",
      "top" : "transformer_residualblock1_activation0",
      "type" : "activation",
      "name" : "transformer_residualblock1_activation0"
    },
    {
      "name" : "transformer_residualblock1_pad1",
      "weights" : {

      },
      "pad_pad_mode" : 0,
      "pad_t" : 1,
      "pad_r" : 1,
      "pad_b" : 1,
      "type" : "general_padding",
      "pad_fill_mode" : 2,
      "bottom" : "transformer_residualblock1_activation0",
      "pad_l" : 1,
      "debug_info" : "transformer_residualblock1_pad1",
      "pad_value" : 0,
      "top" : "transformer_residualblock1_pad1"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "transformer_residual_2_conv_2",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "transformer_residualblock1_conv1_fwd",
      "blob_weights" : 39,
      "K" : 128,
      "blob_biases" : 37,
      "name" : "transformer_residual_2_conv_2",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 128,
      "bottom" : "transformer_residualblock1_pad1",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "name" : "transformer_residualblock1_instancenorm1__fwd_normalize",
      "training_momentum" : 0.89999997615814209,
      "training_eps" : 9.9999997473787516e-06,
      "C" : 128,
      "training" : 1,
      "training_instancenorm" : 1,
      "type" : "batchnorm",
      "blob_batchnorm_params" : 41,
      "bottom" : "transformer_residualblock1_conv1_fwd",
      "debug_info" : "transformer_residualblock1_instancenorm1__fwd_normalize",
      "weights" : {

      },
      "top" : "transformer_residualblock1_instancenorm1__fwd"
    },
    {
      "bottom" : "transformer_residualblock0__plus0,transformer_residualblock1_instancenorm1__fwd",
      "alpha" : 1,
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "transformer_residualblock1__plus0",
      "top" : "transformer_residualblock1__plus0",
      "type" : "elementwise",
      "name" : "transformer_residualblock1__plus0",
      "beta" : 0
    },
    {
      "name" : "transformer_residualblock2_pad0",
      "weights" : {

      },
      "pad_pad_mode" : 0,
      "pad_t" : 1,
      "pad_r" : 1,
      "pad_b" : 1,
      "type" : "general_padding",
      "pad_fill_mode" : 2,
      "bottom" : "transformer_residualblock1__plus0",
      "pad_l" : 1,
      "debug_info" : "transformer_residualblock2_pad0",
      "pad_value" : 0,
      "top" : "transformer_residualblock2_pad0"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "transformer_residual_3_conv_1",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "transformer_residualblock2_conv0_fwd",
      "blob_weights" : 45,
      "K" : 128,
      "blob_biases" : 43,
      "name" : "transformer_residual_3_conv_1",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 128,
      "bottom" : "transformer_residualblock2_pad0",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "name" : "transformer_residualblock2_instancenorm0__fwd_normalize",
      "training_momentum" : 0.89999997615814209,
      "training_eps" : 9.9999997473787516e-06,
      "C" : 128,
      "training" : 1,
      "training_instancenorm" : 1,
      "type" : "batchnorm",
      "blob_batchnorm_params" : 47,
      "bottom" : "transformer_residualblock2_conv0_fwd",
      "debug_info" : "transformer_residualblock2_instancenorm0__fwd_normalize",
      "weights" : {

      },
      "top" : "transformer_residualblock2_instancenorm0__fwd"
    },
    {
      "bottom" : "transformer_residualblock2_instancenorm0__fwd",
      "weights" : {

      },
      "mode" : 0,
      "debug_info" : "transformer_residualblock2_activation0",
      "top" : "transformer_residualblock2_activation0",
      "type" : "activation",
      "name" : "transformer_residualblock2_activation0"
    },
    {
      "name" : "transformer_residualblock2_pad1",
      "weights" : {

      },
      "pad_pad_mode" : 0,
      "pad_t" : 1,
      "pad_r" : 1,
      "pad_b" : 1,
      "type" : "general_padding",
      "pad_fill_mode" : 2,
      "bottom" : "transformer_residualblock2_activation0",
      "pad_l" : 1,
      "debug_info" : "transformer_residualblock2_pad1",
      "pad_value" : 0,
      "top" : "transformer_residualblock2_pad1"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "transformer_residual_3_conv_2",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "transformer_residualblock2_conv1_fwd",
      "blob_weights" : 51,
      "K" : 128,
      "blob_biases" : 49,
      "name" : "transformer_residual_3_conv_2",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 128,
      "bottom" : "transformer_residualblock2_pad1",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "name" : "transformer_residualblock2_instancenorm1__fwd_normalize",
      "training_momentum" : 0.89999997615814209,
      "training_eps" : 9.9999997473787516e-06,
      "C" : 128,
      "training" : 1,
      "training_instancenorm" : 1,
      "type" : "batchnorm",
      "blob_batchnorm_params" : 53,
      "bottom" : "transformer_residualblock2_conv1_fwd",
      "debug_info" : "transformer_residualblock2_instancenorm1__fwd_normalize",
      "weights" : {

      },
      "top" : "transformer_residualblock2_instancenorm1__fwd"
    },
    {
      "bottom" : "transformer_residualblock1__plus0,transformer_residualblock2_instancenorm1__fwd",
      "alpha" : 1,
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "transformer_residualblock2__plus0",
      "top" : "transformer_residualblock2__plus0",
      "type" : "elementwise",
      "name" : "transformer_residualblock2__plus0",
      "beta" : 0
    },
    {
      "name" : "transformer_residualblock3_pad0",
      "weights" : {

      },
      "pad_pad_mode" : 0,
      "pad_t" : 1,
      "pad_r" : 1,
      "pad_b" : 1,
      "type" : "general_padding",
      "pad_fill_mode" : 2,
      "bottom" : "transformer_residualblock2__plus0",
      "pad_l" : 1,
      "debug_info" : "transformer_residualblock3_pad0",
      "pad_value" : 0,
      "top" : "transformer_residualblock3_pad0"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "transformer_residual_4_conv_1",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "transformer_residualblock3_conv0_fwd",
      "blob_weights" : 57,
      "K" : 128,
      "blob_biases" : 55,
      "name" : "transformer_residual_4_conv_1",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 128,
      "bottom" : "transformer_residualblock3_pad0",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "name" : "transformer_residualblock3_instancenorm0__fwd_normalize",
      "training_momentum" : 0.89999997615814209,
      "training_eps" : 9.9999997473787516e-06,
      "C" : 128,
      "training" : 1,
      "training_instancenorm" : 1,
      "type" : "batchnorm",
      "blob_batchnorm_params" : 59,
      "bottom" : "transformer_residualblock3_conv0_fwd",
      "debug_info" : "transformer_residualblock3_instancenorm0__fwd_normalize",
      "weights" : {

      },
      "top" : "transformer_residualblock3_instancenorm0__fwd"
    },
    {
      "bottom" : "transformer_residualblock3_instancenorm0__fwd",
      "weights" : {

      },
      "mode" : 0,
      "debug_info" : "transformer_residualblock3_activation0",
      "top" : "transformer_residualblock3_activation0",
      "type" : "activation",
      "name" : "transformer_residualblock3_activation0"
    },
    {
      "name" : "transformer_residualblock3_pad1",
      "weights" : {

      },
      "pad_pad_mode" : 0,
      "pad_t" : 1,
      "pad_r" : 1,
      "pad_b" : 1,
      "type" : "general_padding",
      "pad_fill_mode" : 2,
      "bottom" : "transformer_residualblock3_activation0",
      "pad_l" : 1,
      "debug_info" : "transformer_residualblock3_pad1",
      "pad_value" : 0,
      "top" : "transformer_residualblock3_pad1"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "transformer_residual_4_conv_2",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "transformer_residualblock3_conv1_fwd",
      "blob_weights" : 63,
      "K" : 128,
      "blob_biases" : 61,
      "name" : "transformer_residual_4_conv_2",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 128,
      "bottom" : "transformer_residualblock3_pad1",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "name" : "transformer_residualblock3_instancenorm1__fwd_normalize",
      "training_momentum" : 0.89999997615814209,
      "training_eps" : 9.9999997473787516e-06,
      "C" : 128,
      "training" : 1,
      "training_instancenorm" : 1,
      "type" : "batchnorm",
      "blob_batchnorm_params" : 65,
      "bottom" : "transformer_residualblock3_conv1_fwd",
      "debug_info" : "transformer_residualblock3_instancenorm1__fwd_normalize",
      "weights" : {

      },
      "top" : "transformer_residualblock3_instancenorm1__fwd"
    },
    {
      "bottom" : "transformer_residualblock2__plus0,transformer_residualblock3_instancenorm1__fwd",
      "alpha" : 1,
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "transformer_residualblock3__plus0",
      "top" : "transformer_residualblock3__plus0",
      "type" : "elementwise",
      "name" : "transformer_residualblock3__plus0",
      "beta" : 0
    },
    {
      "name" : "transformer_residualblock4_pad0",
      "weights" : {

      },
      "pad_pad_mode" : 0,
      "pad_t" : 1,
      "pad_r" : 1,
      "pad_b" : 1,
      "type" : "general_padding",
      "pad_fill_mode" : 2,
      "bottom" : "transformer_residualblock3__plus0",
      "pad_l" : 1,
      "debug_info" : "transformer_residualblock4_pad0",
      "pad_value" : 0,
      "top" : "transformer_residualblock4_pad0"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "transformer_residual_5_conv_1",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "transformer_residualblock4_conv0_fwd",
      "blob_weights" : 69,
      "K" : 128,
      "blob_biases" : 67,
      "name" : "transformer_residual_5_conv_1",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 128,
      "bottom" : "transformer_residualblock4_pad0",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "name" : "transformer_residualblock4_instancenorm0__fwd_normalize",
      "training_momentum" : 0.89999997615814209,
      "training_eps" : 9.9999997473787516e-06,
      "C" : 128,
      "training" : 1,
      "training_instancenorm" : 1,
      "type" : "batchnorm",
      "blob_batchnorm_params" : 71,
      "bottom" : "transformer_residualblock4_conv0_fwd",
      "debug_info" : "transformer_residualblock4_instancenorm0__fwd_normalize",
      "weights" : {

      },
      "top" : "transformer_residualblock4_instancenorm0__fwd"
    },
    {
      "bottom" : "transformer_residualblock4_instancenorm0__fwd",
      "weights" : {

      },
      "mode" : 0,
      "debug_info" : "transformer_residualblock4_activation0",
      "top" : "transformer_residualblock4_activation0",
      "type" : "activation",
      "name" : "transformer_residualblock4_activation0"
    },
    {
      "name" : "transformer_residualblock4_pad1",
      "weights" : {

      },
      "pad_pad_mode" : 0,
      "pad_t" : 1,
      "pad_r" : 1,
      "pad_b" : 1,
      "type" : "general_padding",
      "pad_fill_mode" : 2,
      "bottom" : "transformer_residualblock4_activation0",
      "pad_l" : 1,
      "debug_info" : "transformer_residualblock4_pad1",
      "pad_value" : 0,
      "top" : "transformer_residualblock4_pad1"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "transformer_residual_5_conv_2",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "transformer_residualblock4_conv1_fwd",
      "blob_weights" : 75,
      "K" : 128,
      "blob_biases" : 73,
      "name" : "transformer_residual_5_conv_2",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 128,
      "bottom" : "transformer_residualblock4_pad1",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "name" : "transformer_residualblock4_instancenorm1__fwd_normalize",
      "training_momentum" : 0.89999997615814209,
      "training_eps" : 9.9999997473787516e-06,
      "C" : 128,
      "training" : 1,
      "training_instancenorm" : 1,
      "type" : "batchnorm",
      "blob_batchnorm_params" : 77,
      "bottom" : "transformer_residualblock4_conv1_fwd",
      "debug_info" : "transformer_residualblock4_instancenorm1__fwd_normalize",
      "weights" : {

      },
      "top" : "transformer_residualblock4_instancenorm1__fwd"
    },
    {
      "bottom" : "transformer_residualblock3__plus0,transformer_residualblock4_instancenorm1__fwd",
      "alpha" : 1,
      "operation" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "transformer_residualblock4__plus0",
      "top" : "transformer_residualblock4__plus0",
      "type" : "elementwise",
      "name" : "transformer_residualblock4__plus0",
      "beta" : 0
    },
    {
      "top" : "transformer_upsampling0",
      "use_fractional_scale_factors" : false,
      "weights" : {

      },
      "fractional_scaling_factor_y" : 1,
      "type" : "upsample",
      "scaling_factor_x" : 2,
      "mode" : 0,
      "align_corners" : 0,
      "bottom" : "transformer_residualblock4__plus0",
      "debug_info" : "transformer_upsampling0",
      "fractional_scaling_factor_x" : 1,
      "is_legacy_mode" : 1,
      "name" : "transformer_upsampling0",
      "scaling_factor_y" : 2
    },
    {
      "name" : "transformer_pad3",
      "weights" : {

      },
      "pad_pad_mode" : 0,
      "pad_t" : 1,
      "pad_r" : 1,
      "pad_b" : 1,
      "type" : "general_padding",
      "pad_fill_mode" : 2,
      "bottom" : "transformer_upsampling0",
      "pad_l" : 1,
      "debug_info" : "transformer_pad3",
      "pad_value" : 0,
      "top" : "transformer_pad3"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "transformer_decoding_1_conv",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "transformer_conv3_fwd",
      "blob_weights" : 81,
      "K" : 128,
      "blob_biases" : 79,
      "name" : "transformer_decoding_1_conv",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 64,
      "bottom" : "transformer_pad3",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "name" : "transformer_instancenorm3__fwd_normalize",
      "training_momentum" : 0.89999997615814209,
      "training_eps" : 9.9999997473787516e-06,
      "C" : 64,
      "training" : 1,
      "training_instancenorm" : 1,
      "type" : "batchnorm",
      "blob_batchnorm_params" : 83,
      "bottom" : "transformer_conv3_fwd",
      "debug_info" : "transformer_instancenorm3__fwd_normalize",
      "weights" : {

      },
      "top" : "transformer_instancenorm3__fwd"
    },
    {
      "bottom" : "transformer_instancenorm3__fwd",
      "weights" : {

      },
      "mode" : 0,
      "debug_info" : "transformer_activation3",
      "top" : "transformer_activation3",
      "type" : "activation",
      "name" : "transformer_activation3"
    },
    {
      "top" : "transformer_upsampling1",
      "use_fractional_scale_factors" : false,
      "weights" : {

      },
      "fractional_scaling_factor_y" : 1,
      "type" : "upsample",
      "scaling_factor_x" : 2,
      "mode" : 0,
      "align_corners" : 0,
      "bottom" : "transformer_activation3",
      "debug_info" : "transformer_upsampling1",
      "fractional_scaling_factor_x" : 1,
      "is_legacy_mode" : 1,
      "name" : "transformer_upsampling1",
      "scaling_factor_y" : 2
    },
    {
      "name" : "transformer_pad4",
      "weights" : {

      },
      "pad_pad_mode" : 0,
      "pad_t" : 1,
      "pad_r" : 1,
      "pad_b" : 1,
      "type" : "general_padding",
      "pad_fill_mode" : 2,
      "bottom" : "transformer_upsampling1",
      "pad_l" : 1,
      "debug_info" : "transformer_pad4",
      "pad_value" : 0,
      "top" : "transformer_pad4"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "transformer_decoding_2_conv",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "transformer_conv4_fwd",
      "blob_weights" : 87,
      "K" : 64,
      "blob_biases" : 85,
      "name" : "transformer_decoding_2_conv",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 32,
      "bottom" : "transformer_pad4",
      "weights" : {

      },
      "Nx" : 3,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 3,
      "n_parallel" : 1
    },
    {
      "name" : "transformer_instancenorm4__fwd_normalize",
      "training_momentum" : 0.89999997615814209,
      "training_eps" : 9.9999997473787516e-06,
      "C" : 32,
      "training" : 1,
      "training_instancenorm" : 1,
      "type" : "batchnorm",
      "blob_batchnorm_params" : 89,
      "bottom" : "transformer_conv4_fwd",
      "debug_info" : "transformer_instancenorm4__fwd_normalize",
      "weights" : {

      },
      "top" : "transformer_instancenorm4__fwd"
    },
    {
      "bottom" : "transformer_instancenorm4__fwd",
      "weights" : {

      },
      "mode" : 0,
      "debug_info" : "transformer_activation4",
      "top" : "transformer_activation4",
      "type" : "activation",
      "name" : "transformer_activation4"
    },
    {
      "name" : "transformer_pad5",
      "weights" : {

      },
      "pad_pad_mode" : 0,
      "pad_t" : 4,
      "pad_r" : 4,
      "pad_b" : 4,
      "type" : "general_padding",
      "pad_fill_mode" : 2,
      "bottom" : "transformer_activation4",
      "pad_l" : 4,
      "debug_info" : "transformer_pad5",
      "pad_value" : 0,
      "top" : "transformer_pad5"
    },
    {
      "pad_r" : 0,
      "fused_relu" : 0,
      "fused_tanh" : 0,
      "debug_info" : "transformer_conv5",
      "pad_fill_mode" : 0,
      "pad_b" : 0,
      "pad_l" : 0,
      "top" : "transformer_conv5_fwd",
      "blob_weights" : 93,
      "K" : 32,
      "blob_biases" : 91,
      "name" : "transformer_conv5",
      "has_batch_norm" : 0,
      "type" : "convolution",
      "n_groups" : 1,
      "pad_t" : 0,
      "has_biases" : 1,
      "C" : 3,
      "bottom" : "transformer_pad5",
      "weights" : {

      },
      "Nx" : 9,
      "pad_mode" : 0,
      "pad_value" : 0,
      "Ny" : 9,
      "n_parallel" : 1
    },
    {
      "bottom" : "transformer_conv5_fwd",
      "weights" : {

      },
      "mode" : 3,
      "debug_info" : "transformer_activation5",
      "top" : "transformer_activation5",
      "type" : "activation",
      "name" : "transformer_activation5"
    },
    {
      "bottom" : "",
      "k" : 3,
      "n" : 1,
      "weights" : {

      },
      "h" : 1,
      "debug_info" : "transformer__mulscalar0_output",
      "constant_blob" : 95,
      "top" : "transformer__mulscalar0_output_constant_in_scale",
      "w" : 1,
      "type" : "load_constant",
      "name" : "transformer__mulscalar0_output_constant_in_scale"
    },
    {
      "bottom" : "",
      "k" : 3,
      "n" : 1,
      "weights" : {

      },
      "h" : 1,
      "debug_info" : "transformer__mulscalar0_output",
      "constant_blob" : 97,
      "top" : "transformer__mulscalar0_output_constant_in_bias",
      "w" : 1,
      "type" : "load_constant",
      "name" : "transformer__mulscalar0_output_constant_in_bias"
    },
    {
      "bottom" : "transformer_activation5,transformer__mulscalar0_output_constant_in_scale",
      "alpha" : 1,
      "operation" : 1,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "transformer__mulscalar0_output",
      "top" : "transformer__mulscalar0_output_mul_out",
      "type" : "elementwise",
      "name" : "transformer__mulscalar0_output_mul_out",
      "beta" : 0
    },
    {
      "bottom" : "transformer__mulscalar0_output_mul_out,transformer__mulscalar0_output_constant_in_bias",
      "alpha" : 1,
      "operation" : 0,
      "beta" : 0,
      "weights" : {

      },
      "fused_relu" : 0,
      "debug_info" : "transformer__mulscalar0_output",
      "top" : "stylizedImage",
      "type" : "elementwise",
      "name" : "transformer__mulscalar0_output",
      "attributes" : {
        "is_output" : 1
      }
    }
  ]
}